Repository: Stukeley/AlgorytmySzkolne
Catalog: AlgorytmySzkolne/Languages/*.resx
Languages: pl

# strGlowna
source: Homepage
pl: Strona główna

# strInfo
source: Information
pl: Informacje

# strKlasyczne
source: Classical algorithms
pl: Algorytmy klasyczne

# strZachlanne
source: Greedy algorithms
pl: Algorytmy zachłanne

# strSystemy
source: Numeric systems
pl: Systemy liczbowe

# strONP
source: RPN
pl: ONP

# strProjekty
source: Projects
pl: Projekty

# strAproksymacja
source: PI approximation
pl: Aproksymacja PI

# strEuklides
source: Euklides' Algorithm
pl: Algorytm Euklidesa

# strSilnia
source: Factorial
pl: Silnia

# strPierwsza
source: Prime number
pl: Liczba pierwsza

# strSumaDzielnikow
source: Sum of prime factors
pl: Suma dzielników

# strCzynnikiPierwsze
source: Prime factors
pl: Czynniki pierwsze

# strSumaPrzedzialu
source: Sum of a range
pl: Suma z przedziału

# strSumaCyfr
source: Sum of digits
pl: Suma cyfr

# strRNG
source: Random Number Generator
pl: Generator Liczb Losowych

# strUstaw
source: Set function
pl: Ustaw funkcję

# strZerowe
source: Root of function
pl: Miejsce zerowe funkcji

# strPierwiastek
source: Square root
pl: Pierwiastek kwadratowy

# strPierwiastek2
source: Square root of a number
pl: Pierwiastek kwadratowy z liczby

# strCalka
source: Integral
pl: Całka

# strCalka2
source: Area under the curve
pl: Pole pod wykresem

# oWartosc
source: Value of an RPN expression
pl: Wartość wyrażenia w ONP

# oNaONP
source: To RPN
pl: Na ONP

# oZONP
source: From RPN
pl: Z ONP

# fWielomian
source: Polynomial
pl: Wielomian

# fWymierna
source: Rational function
pl: Funkcja wymierna

# fPierwiastek
source: Square root
pl: Pierwiastek

# fSin
source: Sine
pl: Sinus

# fCos
source: Cosine
pl: Cosinus

# fTg
source: Tangent
pl: Tangens

# fCtg
source: Cotangent
pl: Cotangens

# fLosuj
source: Randomize
pl: Losuj

# fAlternatywa
source: Alternative method
pl: Alternatywna metoda

# aWynik
source: Result
pl: Wynik

# aLiczba
source: Number
pl: Liczba

# aDzielnik
source: Highest common factor
pl: Największy wspólny dzielnik

# aWielokrotność
source: Lowest common multiple
pl: Najmniejsza wielokrotność

# aPierwsza
source: Prime number?
pl: Liczba pierwsza?

# aCzynniki
source: Factorization
pl: Rozkład na czynniki

# aPrzedział
source: Sum of integers from this range
pl: Suma liczb całkowitych z tego przedziału

# strCzyChceszWyjść
source: Would you like to quit the application?
pl: Czy chcesz wyjść z aplikacji?

# strWyjście
source: Exit
pl: Wyjście

# strPodajArgument
source: Provide an argument
pl: Podaj argument

# strPodajEpsilon
source: Provide the accuracy
pl: Podaj dokładność

# strPodajIloscOdcinkow
source: Provide the amount of line segments
pl: Podaj ilość odcinków

# strPodajLiczbę
source: Provide a number
pl: Podaj liczbę

# strPodajLiczbę1
source: Provide the first number
pl: Podaj pierwszą liczbę

# strPodajLiczbę2
source: Provide the second number
pl: Podaj drugą liczbę

# strPrzedział1
source: Provide the start of a range
pl: Podaj początek przedziału

# strPrzedział2
source: Provide the end of a range
pl: Podaj koniec przedziału

# strGranica1
source: Provide lower bound
pl: Podaj dolną granicę

# strGranica2
source: Provide upper bound
pl: Podaj górną granicę

# strInfo1
source: The application is a compilation of most algorithms that we coded during out Computer Science classes in second grade of highschool. It can handle several basic hotkeys.
pl: Aplikacja będąca kompilacją większości algorytmów które pisaliśmy na lekcjach informatyki w klasie 2.liceum w roku szkolnym 2017 / 2018. Obsługuje kilka podstawowych skrótów klawiszowych.

# strInfo2_1
source: ESC: quit the application
pl: ESC: wyjście z aplikacji

# iOstrzeżenie
source: Warning
pl: Ostrzeżenie

# iNiepewne
source: Attention! Shit knows if this works. Are you sure you want to try?
pl: Uwaga! Chuj wie czy to działa. Czy na pewno chcesz spróbować?

# iTypFunkcji
source: Type of function:
pl: Typ funkcji:

# iFunkcja
source: Function:
pl: Funkcja:

# iNWD
source: Provide 2 numbers to get their HCF and LCM.
pl: Podaj 2 liczby by uzyskać ich NWW i NWD.

# iSilnia
source: Provide a number to get its factorial (the factorial can have up to ~600 million digits, but such an attempt can end very, very badly!)
pl: Podaj liczbę aby uzyskać jej silnię (silnia może mieć maksymalnie ~600 milionów cyfr, ale próba taka może skończyć się bardzo, bardzo źle!)

# iPierwsza
source: Provide a number to check whether it's prime or not.
pl: Podaj liczbę aby sprawdzić, czy jest ona pierwsza.

# iSumaDzielników
source: Provide a number to get the sum of all its prime factors.
pl: Podaj liczbę aby uzyskać sumę jej dzielników naturalnych.

# iCzynnikiPierwsze
source: Provide a number to get its factorization (in a non-decreasing order)
pl: Podaj liczbę aby uzyskać jej rozkład na czynniki pierwsze (w kolejności niemalejącej)

# iSumaPrzedziału
source: Provide the start and end of a range to get a number that is the sum of all integers from that range.
pl: Podaj początek i koniec przedziału aby uzyskać liczbę będącą sumą wszystkich liczb całkowitych z tego przedziału (przedział jest obustronnie domknięty)

# iSumaCyfr
source: Provide a number to get the sum of its digits.
pl: Podaj liczbę aby uzyskać sumę wszystkich jej cyfr.

# iRNG
source: Provide 2 numbers to get a random number from that range.
pl: Podaj 2 liczby by uzyskać losową liczbę całkowitą z tego przedziału (obustronnie domkniętego)

# iZerowe
source: Provide the start and end of a range to find the root. Do note that it is possible only when the values of the function at the start and end of the range are of different signs. Also remember to set a function equation before starting the algorithm. If the equation hasn't been set, it is possible to generate a random one.
pl: Podaj początek i koniec przedziału by znaleźć miejsce zerowe. Pamiętaj, że jest to możliwe tylko gdy wartość funkcji na początku i końcu przedziału mają różne znaki. Pamiętaj również o podaniu wzoru funkcji przed uruchomieniem algorytmu. Jeżeli nie podano wzoru, istnieje możliwość jego wylosowania.

# iCałka
source: Provide the accuracy (amount of line segments) and the start and end of a range to get the area under the curve.
pl: Podaj dokładność(ilość odcinków) oraz początek i koniec przedziału by otrzymać pole pod wykresem podanej funkcji. Pamiętaj o podaniu wzoru funkcji przed uruchomieniem algorytmu. Jeżeli nie podano wzoru, istnieje możliwość jego wylosowania.Domyślna wartość: 10000 lub więcej.

# iPierwiastek
source: Provide the accuracy and a number to get its square root. Default value: 0.0001. Both period and comma are allowed.
pl: Podaj dokładność obliczeń oraz liczbę aby otrzymać jej pierwiastek kwadratowy. Domyślna wartość: 0,0001 lub mniej. Dozwolone jest zarówno podawanie z kropką, jak i z przecinkiem.

# iONPWartość
source: Provide an expression in RPN (Reverse Polish Notation) to get its value.
pl: Podaj wyrażenie w ONP aby uzyskać jego wartość. Przykład: 2 3 + 4 * Wynik: 20

# iONPZ
source: Provide an expression in RPN (Reverse Polish Notation) to get its equivalent in regular notation.
pl: Podaj wyrażenie w ONP aby uzyskać jego odpowiednik w notacji normalnej. Przykład: 2 3 + 4 * Wynik: (2+3)*4

# iONPNa
source: Provide an expression in regular notation to get its equivalent in RPN (Reverse Polish Notation)
pl: Podaj wyrażenie w notacji normalnej aby uzyskać jego odpowiednik w ONP. Przykład: (2+3)*4 Wynik: 2 3 + 4 *

# pArgument
source: Provide an argument...
pl: Podaj argument...

# pOblicz
source: Calculate!
pl: Oblicz!

# pWykonaj
source: Execute!
pl: Wykonaj!

# eBłąd
source: Error
pl: Błąd

# eSukces
source: Success
pl: Sukces

# eWylosowano
source: Random function equation set successfully.
pl: Wylosowano wzór funkcji pomyślnie.

# eNieZnaleziono
source: Not found
pl: Nie znaleziono

# emsgBłądArgumentu
source: Error of argument/s!
pl: Błąd argumentu/ów!

# emsgNiePodanoFunkcji
source: No function equation set!
pl: Nie podano wzoru funkcji!

# emsgBłądFunkcji
source: No function set! Would you like to randomize an equation?
pl: Nie podano funkcji! Czy chcesz wylosować wzór?

# emsgFormatWejścia
source: Incorrect format of input.
pl: Nieprawidłowy format wejścia.

# emsgPodstawaSystemu
source: The maximum base of a numeral system is 36 !
pl: Maksymalna podstawa systemu liczbowego to 36 !

# emsgException
source: Something went wrong.
pl: Coś poszło nie tak.

# emsgAproksymacjaPunkty
source: A wrong number of points has been given! The default value will be set.
pl: Podano niewłaściwą ilość punktów! Zostanie przydzielona wartość domyślna.

# emsgSierpinskiPoziomy
source: An incorrect number has been given! The default value will be set.
pl: Nie podano poprawnej liczby! Zostanie ustawiona wartość domyślna.

# emsgIlośćOdcinków
source: Error in line segment amount.
pl: Błąd w ilości odcinków.

# hIlośćH
source: Amount of bishops
pl: Ilość hetmanów

# hIlośćS
source: Amount of Knights
pl: Ilość skoczków

# hFailH
source: Failed to put down eight bishops.
pl: Nie udało ci się postawić ośmiu hetmanów.

# hFailS
source: Failed to place the knight on all tiles.
pl: Nie udało ci się postawić skoczka na każdym polu.

# hNieMożnaH
source: Cannot place a bishop here!
pl: Nie można tu postawić hetmana!

# hNieMożnaS
source: Cannot place the knight here!
pl: Nie można tu przesunąć skoczka!

# hGratulacjeH
source: Congratulations, you put down eight bishops!
pl: Gratulacje, udało Ci się postawić ośmiu hetmanów!

# hGratulacjeS
source: Congratulations, you placed the knight on all tiles exactly once!
pl: Gratulacje, udało ci się postawić skoczka na każdym miejscu dokładnie jeden raz!

# hRestart
source: Would you like to start over?
pl: Czy chcesz zacząć od nowa?

# bAproksymacja
source: Approximation
pl: Aproksymacja

# bCałka
source: Integral
pl: Całka

# bDokładność
source: Accuracy
pl: Dokładność

# bHetmani
source: Bishops
pl: Hetmani

# bKlasyczne
source: Classical
pl: Klasyczne

# bKopiuj
source: Copy
pl: Kopiuj

# bLiczbaPierwsza
source: Prime number
pl: Liczba pierwsza

# bMiejsceZerowe
source: Function root
pl: Miejsce zerowe funkcji

# bNWD
source: HCF
pl: NWD i NWW

# bONP
source: RPN
pl: ONP

# bPierwiastekKwadratowy
source: Square root
pl: Pierwiastek kwadratowy

# bPokaż
source: Show
pl: Pokaż

# bPokażFunkcję
source: View function
pl: Pokaż wzór funkcji

# bPoziomy
source: Provide number of levels
pl: Podaj ilość poziomów

# bProjekty
source: Projects
pl: Projekty

# bRNG
source: Random Number Generator
pl: Generator Liczb Losowych

# bRozkład
source: Factorization
pl: Rozkład na czynniki

# bSierpiński
source: Sierpiński's Triangle
pl: Trójkąt Sierpińskiego

# bSilnia
source: Factorial
pl: Silnia

# bSkoczek
source: Knight
pl: Skoczek

# bSumaCyfr
source: Sum of digits
pl: Suma cyfr

# bSumaDzielników
source: Sum of factors
pl: Suma dzielników

# bSumaPrzedziału
source: Sum of range
pl: Suma z przedziału

# bSystemNaKtóry
source: To which
pl: Na który

# bSystemPodaj
source: Provide a number in this system
pl: Podaj liczbę w tym systemie

# bSystemy
source: Numeric systems
pl: Zamiana systemów liczbowych

# bSystemZKtórego
source: From which
pl: Z którego

# bUstaw
source: Set
pl: Ustaw

# bUstawFunkcję
source: Set function
pl: Ustaw funkcję

# bWybierzAlgorytm
source: Choose algorithm
pl: Wybierz algorytm

# bWybierzFunkcję
source: Choose function
pl: Wybierz funkcję

# bWykres
source: Function graph
pl: Wykres funkcji

# bZachlanne
source: Greedy
pl: Zachłanne

# eUstawiono
source: Function has been set correctly.
pl: Ustawiono funkcję pomyślnie.

# strInfo2_2
source: 1-8: choice of a given algorithm(only on the algorithm selection screen)
pl: 1 - 8: wybór danego algorytmu(tylko na ekranie wyboru algorytmów)

# strInfo2_3
source: TAB: next control
pl: TAB: następna kontrolka

# bPrzykład
source: Example
pl: Przykład

# bPodajStopień
source: Provide the degree
pl: Podaj stopień

# bPodajStopieńFunkcji
source: Provide the degree of function
pl: Podaj stopień funkcji

# bPodajStopieńLicznika
source: Provide the degree of numerator
pl: Podaj stopień licznika

# bPodajStopieńMianownika
source: Provide the degree of denominator
pl: Podaj stopień mianownika

# bPodajStopieńPierwiastka
source: Provide the degree of root
pl: Podaj stopień pierwiastka

# bWybierzArgument
source: Choose argument
pl: Wybierz argument

# bWybierzTypArgumentu
source: Choose argument type
pl: Wybierz typ argumentu

# emsgNieprawidłowyStopień
source: Incorrect degree of function
pl: Nieprawidłowy stopień funkcji

# emsgStopieńLosowejFunkcji
source: Incorrectly set the degree of function. Do note only positive integers are allowed.
pl: Nieporawnie podano stopień losowej funkcji. Pamiętaj, że dozwolone są tylko liczby całkowite dodatnie.

# iFLosuj
source: Provide the degree of function (it has to be a positive integer). Then the program will randomize all the coefficients, and the function will be ready to use.
pl: Podaj stopień funkcji(musi być to liczba całkowita dodatnia). Następnie program sam wylosuje wszystkie współczynniki i funkcja będzie gotowa do użycia.

# iFPierwiastek
source: First choose the degree of inner function and the degree of the root. Then provide the degree of the root preceded by the letter S, then provide all coefficients of the innter function (even if they are equal to 0). See example.
pl: Wybierz stopień funkcji pod pierwiastkiem oraz stopień pierwiastka. Następnie podaj stopień pierwiastka poprzedzony literą S, po czym podaj oddzielone spacjami wszystkie współczynniki, nawet gdy wynoszą 0.

# iFTrygonometrycznaPI
source: Function moved by the given amount of PI. Can contain fractions, but only decimal. Provide only one number
pl: Funkcja przesunięta o podaną ilość PI. Może zawierać ułamki, ale tylko w postaci dziesiętnej. Podaj tylko jedną liczbę.

# iFTrygonometrycznaX
source: Provide the degree of the argument, then all the coefficients (even if they are equal to 0) divided by single spaces.
pl: Podaj stopień argumentu, a następnie wszystkie współczynniki oddzielone spacjami. Podaj współczynniki nawet gdy wynoszą one zero.

# iFWielomian
source: Choose the degree of polynomial, then provide all coefficients divided by a single space. Provide the coefficients even if they are equal to 0.
pl: Wybierz stopień wielomianu, a nastepnie podaj wszystkie współczynniki oddzielone spacjami. Podaj współczynniki nawet gdy wynoszą one zero.

# iFWymierna
source: Choose the degree of numerator and denominator, then provide all coefficients (even if they are equal to 0) divided by a single space in parentheses preceded by the letters L (for numerator) and M (for denominator). See example.
pl: Wybierz stopień licznika i mianownika, a nastepnie podaj wszystkie współczynniki oddzielone spacjami w nawiasach (rownież oddzielonych spacjami) poprzedzonych literami L i M.

# tAlgorytmySzkolne
source: School Algorithms
pl: Algorytmy Szkolne

# tAproksymacja
source: Approximation
pl: Aproksymacja

# tHetmani
source: Bishops
pl: Hetmani

# tSierpiński
source: Sierpinski Triangle
pl: Trójkąt Sierpińskiego

# tSkoczek
source: Knight
pl: Skoczek

# tWykres
source: Function graph
pl: Szkic wykresu funkcji
